In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']

In [4]:
minha_lista = [10, 20, 30]
arr = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30 }

In [5]:
pd.Series(data = minha_lista, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
series = pd.Series(data = minha_lista, index = labels)

In [8]:
series['b']

20

In [9]:
pd.Series(minha_lista, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [12]:
ser1 = pd.Series([1, 2, 3, 4], index=['EUA', 'Alemanha', 'URSS', 'Japão'])

In [13]:
ser1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [14]:
ser2 = pd.Series([1, 2, 3, 4], index=['EUA', 'Alemanha', 'Itália', 'Japão'])

In [15]:
ser2

EUA         1
Alemanha    2
Itália      3
Japão       4
dtype: int64

In [16]:
ser1 + ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
URSS        NaN
dtype: float64

## DataFrame

In [1]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(101)

In [44]:
df = pd.DataFrame(np.random.randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
type(df['W'])

pandas.core.series.Series

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [10]:
df['new']

KeyError: 'new'

In [11]:
df['new'] = df['W'] + df['X']

In [12]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [13]:
df.drop('new')

KeyError: "['new'] not found in axis"

In [14]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [16]:
df.drop('new', axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.loc['A','W']

2.706849839399938

In [19]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [20]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [21]:
df.iloc[1:4, 2:]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [24]:
bol = df > 0

In [25]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [30]:
bol = df['W']>0

In [31]:
df2 = df[bol]

In [32]:
df2['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [33]:
df[(df['W']>0) and (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [34]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df[(df['W']>0) or (df['Y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [36]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df.reset_index(inplace=True)

In [41]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [42]:
col = 'RS RJ SP AM SC'.split()

In [43]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [45]:
df['Estado'] = col

In [46]:
df

          W         X         Y         Z Estado
A  0.302665  1.693723 -1.706086 -1.159119     RS
B -0.134841  0.390528  0.166905  0.184502     RJ
C  0.807706  0.072960  0.638787  0.329646     SP
D -0.497104 -0.754070 -0.943406  0.484752     AM
E -0.116773  1.901755  0.238127  1.996652     SC

In [47]:
df.set_index('Estado')

               W         X         Y         Z
Estado
RS      0.302665  1.693723 -1.706086 -1.159119
RJ     -0.134841  0.390528  0.166905  0.184502
SP      0.807706  0.072960  0.638787  0.329646
AM     -0.497104 -0.754070 -0.943406  0.484752
SC     -0.116773  1.901755  0.238127  1.996652

In [48]:
df

          W         X         Y         Z Estado
A  0.302665  1.693723 -1.706086 -1.159119     RS
B -0.134841  0.390528  0.166905  0.184502     RJ
C  0.807706  0.072960  0.638787  0.329646     SP
D -0.497104 -0.754070 -0.943406  0.484752     AM
E -0.116773  1.901755  0.238127  1.996652     SC

In [49]:
df.set_index('Estado', inplace=True)

In [50]:
df

               W         X         Y         Z
Estado
RS      0.302665  1.693723 -1.706086 -1.159119
RJ     -0.134841  0.390528  0.166905  0.184502
SP      0.807706  0.072960  0.638787  0.329646
AM     -0.497104 -0.754070 -0.943406  0.484752
SC     -0.116773  1.901755  0.238127  1.996652

## DataFrame - Índices multiníveis

In [55]:
# Níveis de Índice
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [52]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [56]:
inside

[1, 2, 3, 1, 2, 3]

In [57]:
hier_index = list(zip(outside, inside))

In [58]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [59]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [60]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [64]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns = ['A', 'B'])

In [65]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [66]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [67]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [68]:
df.index.names

FrozenList([None, None])

In [69]:
df.index.names = ['Grupo', 'Numero']

In [70]:
df

                     A         B
Grupo Numero
G1    1       0.147027 -0.479448
      2       0.558769  1.024810
      3      -0.925874  1.862864
G2    1      -1.133817  0.610478
      2       0.386030  2.084019
      3      -0.376519  0.230336

In [72]:
df.xs('G1')

               A         B
Numero
1       0.147027 -0.479448
2       0.558769  1.024810
3      -0.925874  1.862864

In [73]:
df.xs(1, level='Numero')

              A         B
Grupo
G1     0.147027 -0.479448
G2    -1.133817  0.610478

## Dados ausentes

In [74]:
d = {'A': [1,2,np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}

In [75]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [76]:
df = pd.DataFrame(d)

In [77]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [78]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [79]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [80]:
df.fillna(value='Fill na')

         A        B  C
0        1        5  1
1        2  Fill na  2
2  Fill na  Fill na  3

In [81]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [82]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [83]:
df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

## Group By

In [84]:
# cria um DataFrame
data = {'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Nome':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [85]:
data

{'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Venda': [200, 120, 340, 124, 243, 350]}

In [87]:
df = pd.DataFrame(data)

In [88]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [89]:
df.groupby('Empresa')

In [90]:
group = df.groupby('Empresa')

In [91]:
group

In [92]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [93]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [94]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [96]:
group = df.groupby('Nome')

In [97]:
group

In [98]:
group.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [100]:
group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64

## Concatenar, juntar e mesclar

In [101]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'b2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                  index=[0,1,2,3])

In [102]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'b6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']},
                  index=[4,5,6,7])

In [103]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'b10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index=[8,9,10,11])

In [104]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  b2  C2  D2
3  A3  B3  C3  D3

In [105]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  b6  C6  D6
7  A7  B7  C7  D7

In [108]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  b10  C10  D10
11  A11  B11  C11  D11

Concatenação basicamente cola DataFrames. Tenha em mente que as dimensões devem corresponder ao logo do eixo que você esta concatenando. Você pode usar pd.cacat e passar umalista de DataFrames para concatenar juntos.

In [107]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   b2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   b6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  b10  C10  D10
11  A11  B11  C11  D11

In [109]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   b2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   b6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  b10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Outros DataFrames

In [111]:
esquerda = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
direita = pd.DataFrame({'key': ['k0', 'k1', 'k2', 'k3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [112]:
esquerda

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [113]:
direita

  key   C   D
0  k0  C0  D0
1  k1  C1  D1
2  k2  C2  D2
3  k3  C3  D3

## Mesclar

A função mesclar permite que você mescle os quadros de dados juntos usando uma lógica semelhante á mesclagem de tabelas SQL juntas. Por exemplo:

In [114]:
pd.merge(esquerda, direita, how='inner', on='key')

  key   A   B   C   D
0  k0  A0  B0  C0  D0
1  k1  A1  B1  C1  D1
2  k2  A2  B2  C2  D2
3  k3  A3  B3  C3  D3

Ou para mostrar um exemplo mais complicado

In [119]:
esquerda = pd.DataFrame({'key1': ['k0', 'k0', 'k1', 'k2'],
                         'key2': ['k0', 'k1', 'k0', 'k1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
direita = pd.DataFrame({'key1': ['k0', 'k1', 'k1', 'k2'],
                        'key2': ['k0', 'k0', 'k0', 'k0'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [120]:
direita

  key1 key2   C   D
0   k0   k0  C0  D0
1   k1   k0  C1  D1
2   k1   k0  C2  D2
3   k2   k0  C3  D3

In [121]:
esquerda

  key1 key2   A   B
0   k0   k0  A0  B0
1   k0   k1  A1  B1
2   k1   k0  A2  B2
3   k2   k1  A3  B3

In [122]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   k0   k0  A0  B0  C0  D0
1   k1   k0  A2  B2  C1  D1
2   k1   k0  A2  B2  C2  D2

In [124]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   k0   k0   A0   B0   C0   D0
1   k0   k1   A1   B1  NaN  NaN
2   k1   k0   A2   B2   C1   D1
3   k1   k0   A2   B2   C2   D2
4   k2   k1   A3   B3  NaN  NaN
5   k2   k0  NaN  NaN   C3   D3

In [126]:
pd.merge(esquerda, direita, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   k0   k0   A0   B0  C0  D0
1   k1   k0   A2   B2  C1  D1
2   k1   k0   A2   B2  C2  D2
3   k2   k0  NaN  NaN  C3  D3

In [127]:
pd.merge(esquerda, direita, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   k0   k0  A0  B0   C0   D0
1   k0   k1  A1  B1  NaN  NaN
2   k1   k0  A2  B2   C1   D1
3   k1   k0  A2  B2   C2   D2
4   k2   k1  A3  B3  NaN  NaN

## Juntar

Juntar é um método conveniente para combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único resultado DataFrame

In [130]:
esquerda = pd.DataFrame({'A':['A0', 'A1', 'A2'],
                        'B':['B0', 'B1', 'B2']},
                       index=['K0', 'K1', 'K2'])
direita = pd.DataFrame({'C':['C0', 'C1', 'C2'],
                       'D':['C0', 'C1', 'C2']},
                      index=['K0', 'K2', 'K3'])

In [131]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [132]:
direita

     C   D
K0  C0  C0
K2  C1  C1
K3  C2  C2

In [133]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   C0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   C1

In [134]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   C0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   C1
K3  NaN  NaN   C2   C2

## Operações

In [135]:
df = pd.DataFrame({'col1': [1,2,3,4], 'col2':[444, 555, 666, 444], 'col3':['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Seleção de dados únicos

In [136]:
df['col2'].unique()

array([444, 555, 666])

In [137]:
np.unique(df['col2'])

array([444, 555, 666])

In [138]:
len(df['col2'].unique())

3

In [139]:
df['col2'].nunique()

3

In [141]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

seleção de dados

In [142]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [143]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [147]:
def vezes2(x):
    return x*2

In [145]:
df.sum()

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [146]:
df['col1'].sum()

10

In [148]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [149]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [150]:
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [151]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [152]:
del df['col2']

In [153]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [154]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [155]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [156]:
df = pd.DataFrame({'col1': [1,2,3,4], 'col2':[444, 555, 666, 444], 'col3':['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [157]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [159]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [160]:
df.sort_values(by='col2', inplace=True)

In [161]:
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [162]:
df.isnull()

    col1   col2   col3
0  False  False  False
3  False  False  False
1  False  False  False
2  False  False  False

In [163]:
df.dropna()

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [165]:
df = pd.DataFrame({'col1': [1,2,3,np.nan],
                  'col2': [np.nan, 555, 666, 444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [166]:
df['col1'].fillna(value=df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [168]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [169]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}
df = pd.DataFrame(data)

In [170]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [171]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Entrada e Saída de dados

In [175]:
df = pd.read_csv('exemplo', sep=',')

In [176]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [177]:
df = df + 1

In [178]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [179]:
df.to_csv('exemplo.csv', sep=';', decimal=',')

In [182]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1')

In [183]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [184]:
df.to_excel('exemplo.xlsx', sheet_name='Sheet1')

In [185]:
df=pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [186]:
type(df)

list

In [187]:
len(df)

1

In [188]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [190]:
df[0]['Bank Name']

0                   The First State Bank
1                     Ericson State Bank
2       City National Bank of New Jersey
3                          Resolute Bank
4                  Louisa Community Bank
                     ...
556                   Superior Bank, FSB
557                  Malta National Bank
558      First Alliance Bank & Trust Co.
559    National State Bank of Metropolis
560                     Bank of Honolulu
Name: Bank Name, Length: 561, dtype: object